       01 lnk-program                  pic x(128).
       01 lnk-program-len              pic s9(9) comp-5.
       01 lnk-exec-style               pic s9(9) comp-5.
       01 lnk-exec-info                pic x.
       01 lnk-exec-cics-info           MFU-PP-MOCK-EXEC-INFO.
