       01 td-flyer-status-points        pic 9(9) typedef.
       01 td-flyer-status               pic x(20) typedef.
       01 :prefix:-flyer-info.
           03 :prefix:-award-level      td-flyer-status.
           03 :prefix:-award-points    td-flyer-status-points.