       01 lnk-program                 PIC x(MFU-PP-CONTROLLER-PRG-SIZE).
       01 lnk-program-len             PIC s9(9) comp-5.
       01 lnk-exec-style              PIC s9(9) comp-5.
       01 lnk-exec-info               MFU-PP-MOCK-EXEC-INFO.
