       IDENTIFICATION DIVISION.
       PROGRAM-ID. CANIADD.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 REPLY-LINE    PIC X(80).
       01 REPLY-PARTS   PIC X(25) OCCURS 3.
       01 NUM1          PIC 9(9) VALUE ZEROS.
       01 NUM2          PIC 9(9) VALUE ZEROS.
       01 EXP-RESULT    PIC 9(18) VALUE ZEROS.
       01 RESULT        PIC 9(18) VALUE ZEROS.
      *
       PROCEDURE DIVISION.
           ACCEPT REPLY-LINE FROM CONSOLE
           DISPLAY "GOT - " REPLY-LINE UPON CONSOLE
           UNSTRING REPLY-LINE DELIMITED BY SPACE
               INTO REPLY-PARTS(1), REPLY-PARTS(2), REPLY-PARTS(3)
           END-UNSTRING
           IF REPLY-PARTS(1) EQUAL SPACES OR
              REPLY-PARTS(2) EQUAL SPACES OR
              REPLY-PARTS(3) EQUAL SPACES
               DISPLAY "NOT ENOUGH PARAMETERS GIVEN" UPON CONSOLE
               STOP RUN RETURNING 8
           END-IF
               
      * CALCULATE A + B AND ENSURE IT EQUALS C!
           MOVE FUNCTION NUMVAL(REPLY-PARTS(1)) TO NUM1
           MOVE FUNCTION NUMVAL(REPLY-PARTS(2)) TO NUM2
           MOVE FUNCTION NUMVAL(REPLY-PARTS(3)) TO EXP-RESULT
           ADD NUM1 TO NUM2 GIVING RESULT

      * ENSURE THE RESULTS IS OKAY!
           if EXP-RESULT NOT EQUAL RESULT
               DISPLAY "RESULT IS WRONG, I THINK IT IS : "
                    RESULT UPON CONSOLE
               DISPLAY "BUT THE TEST EXPECTS IT TO BE  : " 
                   EXP-RESULT UPON CONSOLE
               STOP RUN RETURNING 8
           END-IF
           DISPLAY "RESULT IS OK AND IS ", RESULT UPON CONSOLE
           STOP RUN RETURNING 0.