//JCLDM2  JOB 'JCLCOMP',CLASS=A,MSGCLASS=A 
//STEPDEL EXEC PGM=IEFBR14
//SYSUT3  DD DSN=TEST.OUTPUT,DISP=(MOD,DELETE),
//        SPACE=(TRK,1)
//*------------------------------------------------------------------
//*  IEBCOMPR - TYPORG=PS - RECORDS MATCH
//*-------------------------------------------------------------------
//STEP04   EXEC PGM=IEBCOMPR
//SYSPRINT DD SYSOUT=*
//SYSUT1 DD *
AAAAAAAAAABBBBBBBBBBCCCCCCCCCCDDDDDDDDDDEEEEEEEEEEFFFFFFFFFFGGGGGGGGGG
AAAAAAAAAABBBBBBBBBBCCCCCCCCCCDDDDDDDDDDEEEEEEEGEEFFFFFFFFFFGGGGGGGGGG
XXXXXXXXXXBBBBBBBBBBCCCCCCCCCCDDDDDDDDDDEEEEEEEEEEFFFFFFFFFFGGGGGGGGGG
//SYSUT2 DD *
AAAAAAAAAABBBBBBBBBBCCCCCCCCCCDDDDDDDDDDEEEEEEEEEEFFFFFFFFFFGGGGGGGGGG
AAAAAAAAAABBBBBBBBBBCCCCCCCCCCDDDDDDDDDDEEEEEEEEEEFFFFFFFFFFGGGGGGGGGG
BXXXXXXXXXBBBBBBBBBBCCCCCCCCCCDDDDDDDDDDEEEEEEEEEEFFFFFFFFFFGGGGGGGGGG
//SYSIN DD *
  COMPARE TYPORG=PS
//SYSUT3  DD SYSOUT=*,LRECL=70
//* //SYSUT3  DD DSN=TEST.OUTPUT,DISP=(NEW,CATLG),
//* //        UNIT=SYSDA,SPACE=(TRK,1),DCB=*.SYSUT1
//
